{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null], "dtype": "string", "sparse": false, "ragged": false, "name": "text"}, "name": "text", "inbound_nodes": []}, {"class_name": "KerasLayer", "config": {"name": "preprocessing", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_preprocess/3"}, "name": "preprocessing", "inbound_nodes": [[["text", 0, 0, {}]]]}, {"class_name": "KerasLayer", "config": {"name": "BERT_encoder", "trainable": true, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/small_bert/bert_en_uncased_L-2_H-128_A-2/2"}, "name": "BERT_encoder", "inbound_nodes": [{"input_mask": ["preprocessing", 0, 0, {}], "input_word_ids": ["preprocessing", 0, 2, {}], "input_type_ids": ["preprocessing", 0, 1, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["BERT_encoder", 0, 3, {}]]]}, {"class_name": "Dense", "config": {"name": "classifier", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "classifier", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "regression", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "regression", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "input_layers": [["text", 0, 0]], "output_layers": {"regression": ["regression", 0, 0], "classifier": ["classifier", 0, 0]}}}, "training_config": {"loss": {"class_name": "BinaryCrossentropy", "config": {"reduction": "auto", "name": "binary_crossentropy", "from_logits": true, "label_smoothing": 0, "axis": -1}}, "metrics": [[{"class_name": "BinaryAccuracy", "config": {"name": "classifier_binary_accuracy", "dtype": "float32", "threshold": 0.5}}], [{"class_name": "BinaryAccuracy", "config": {"name": "regression_binary_accuracy", "dtype": "float32", "threshold": 0.5}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "clipnorm": 1.0, "learning_rate": 4.999999873689376e-05, "decay": 0.01, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-08, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "word_embeddings/embeddings", "shape": [30522, 128], "dtype": "float32"}, {"name": "position_embedding/embeddings", "shape": [512, 128], "dtype": "float32"}, {"name": "type_embeddings/embeddings", "shape": [2, 128], "dtype": "float32"}, {"name": "embeddings/layer_norm/gamma", "shape": [128], "dtype": "float32"}, {"name": "embeddings/layer_norm/beta", "shape": [128], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/query/kernel", "shape": [128, 2, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/query/bias", "shape": [2, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/key/kernel", "shape": [128, 2, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/key/bias", "shape": [2, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/value/kernel", "shape": [128, 2, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/value/bias", "shape": [2, 64], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/attention_output/kernel", "shape": [2, 64, 128], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention/attention_output/bias", "shape": [128], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention_layer_norm/gamma", "shape": [128], "dtype": "float32"}, {"name": "transformer/layer_0/self_attention_layer_norm/beta", "shape": [128], "dtype": "float32"}, {"name": "transformer/layer_0/intermediate/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "transformer/layer_0/intermediate/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_0/output/kernel", "shape": [512, 128], "dtype": "float32"}, {"name": "transformer/layer_0/output/bias", "shape": [128], "dtype": "float32"}, {"name": "transformer/layer_0/output_layer_norm/gamma", "shape": [128], "dtype": "float32"}, {"name": "transformer/layer_0/output_layer_norm/beta", "shape": [128], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/query/kernel", "shape": [128, 2, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/query/bias", "shape": [2, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/key/kernel", "shape": [128, 2, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/key/bias", "shape": [2, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/value/kernel", "shape": [128, 2, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/value/bias", "shape": [2, 64], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/attention_output/kernel", "shape": [2, 64, 128], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention/attention_output/bias", "shape": [128], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention_layer_norm/gamma", "shape": [128], "dtype": "float32"}, {"name": "transformer/layer_1/self_attention_layer_norm/beta", "shape": [128], "dtype": "float32"}, {"name": "transformer/layer_1/intermediate/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "transformer/layer_1/intermediate/bias", "shape": [512], "dtype": "float32"}, {"name": "transformer/layer_1/output/kernel", "shape": [512, 128], "dtype": "float32"}, {"name": "transformer/layer_1/output/bias", "shape": [128], "dtype": "float32"}, {"name": "transformer/layer_1/output_layer_norm/gamma", "shape": [128], "dtype": "float32"}, {"name": "transformer/layer_1/output_layer_norm/beta", "shape": [128], "dtype": "float32"}, {"name": "pooler_transform/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "pooler_transform/bias", "shape": [128], "dtype": "float32"}, {"name": "Variable", "shape": [], "dtype": "bool"}, {"name": "classifier/kernel", "shape": [128, 1], "dtype": "float32"}, {"name": "classifier/bias", "shape": [1], "dtype": "float32"}, {"name": "regression/kernel", "shape": [128, 1], "dtype": "float32"}, {"name": "regression/bias", "shape": [1], "dtype": "float32"}]}]}